<?php
$_['heading_title'] = 'Генерация SEO URL';
$_['text_home'] = 'Главная';
$_['text_edit'] = 'Настройки генерации SEO URL';
$_['text_enabled'] = 'Включено';
$_['text_disabled'] = 'Отключено';
$_['text_success_save'] = 'Настройки модуля сохранены.';
$_['text_success_generate'] = 'Сгенерировано SEO URL: %s';
$_['text_cron_status'] = 'Разрешить запуск по CRON';
$_['text_cron_title'] = 'Важно:';
$_['text_cron_info'] = 'вы можете вызвать генерацию SEO URL через CRON. Используйте один из вариантов ниже. При необходимости уточните детали у вашего хостинг-провайдера.';
$_['text_cron_manual'] = 'Для ручного запуска вы можете открыть в браузере:';
$_['entry_generate'] = 'Ручной запуск генерации';
$_['entry_cron_path'] = 'Ссылка для запуска по CRON';
$_['button_generate'] = 'Сгенерировать сейчас';
$_['button_save'] = 'Сохранить';
$_['error_permission'] = 'У вас нет прав для управления этим модулем.';

//helpers
$_['text_help']          = 'Информация';
$_['help_auto_seo_url']  = 'Модуль <b>AUTO SEO URL</b> позволяет в автоматическом режиме производить генерацию SEO URL путём транслитерации наименований товаров.
<br> Данный модуль значительно упрощает добавление новых товаров на сайт, делая URL читаемыми и оптимальными для поисковых систем.
<br> В стандартной версии OpenCart SEO URL приходится прописывать вручную, что создаёт дополнительные неудобства при работе с большим количеством товаров.
<br> С помощью модуля генерация SEO URL происходит автоматически путём транслитерации наименования товара.
<br> Большинство бесплатных решений предоставляют возможность автоматического создания URL товаров только при ручном вводе и сохранении карточки товара.
<br> А что, если товары выгружаются через CSV, EXCEL или иным способом?
<br> В таком случае большинство модулей просто не видит этих изменений, и приходится искать способ генерации URL для импортируемых товаров.
<br> Именно для таких целей и был создан данный модуль — чтобы облегчить работу администраторам, позволяя генерировать любое количество SEO URL товаров нажатием одной кнопки.
<br> Для опытных пользователей в настройках модуля предусмотрена возможность запуска автоматической генерации SEO URL через CRON для товаров, у которых поле SEO URL не заполнено.
<br> Модуль значительно упрощает работу с товарами, позволяя сосредоточиться на более важных задачах.
<br> Не тратьте время на ручную работу — выбирайте автоматическую генерацию или используйте кнопку в настройках вашего магазина!';
$_['text_footer_help'] = 'По вопросам, связанным с работой модуля <b>AUTO SEO URL</b>, обращаться к <a href="https://vshkov.ru/" target="_blank" rel="noopener noreferrer"><b>vshkov.ru</b></a>
<br><br>Обращаем внимание: модуль распространяется бесплатно, но все дополнительные доработки, не связанные с его функционалом, — <b>ПЛАТНЫЕ</b>!';
